app/Http/Controllers/Frontend/ListingController.php

SELECT `person`.*, (SELECT `post_code` FROM `address` WHERE `person_id` = `person`.`id` LIMIT 1) as `post_code` FROM `person` WHERE `person`.`deleted_at` IS NULL ORDER BY `id` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `person` WHERE `person`.`deleted_at` IS NULL
---
    public function index(Request $request)
    {
        $persons = Person::addSelect(['post_code' => function ($query) {
        $query->select('post_code')
            ->from('address')
            ->whereColumn('person_id', 'person.id')
            ->limit(1);
        }])->orderBy('id', 'desc')
        ->paginate(10);
        return view('frontend.listing.index', ['persons' => $persons, 'page' => $request->page]);