app/Http/Controllers/Admin/AddressController.php

SELECT * FROM `address` WHERE `person_id` = '37' and `address`.`deleted_at` IS NULL ORDER BY `id` DESC
---
    public function show($id)
    {
        $address = Address::where('person_id', $id)->orderBy('id', 'desc')->get();