app/Http/Controllers/Admin/PersonController.php

    public function index(Request $request)
    {
        $persons = Person::addSelect(['post_code' => function ($query) {
            $query->select('post_code')
            ->from('address')
            ->whereColumn('person_id', 'person.id')
            ->limit(1);
        }])->orderBy('id', 'desc')
        ->paginate(10);
        return view('admin.person.index', ['persons' => $persons, 'page' => $request->page]);
---
SELECT `person`.*, (SELECT `post_code` FROM `address` WHERE `person_id` = `person`.`id` LIMIT 1) as `post_code` FROM `person` WHERE `person`.`deleted_at` IS NULL ORDER BY `id` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `person` WHERE `person`.`deleted_at` IS NULL
SELECT * FROM `address` WHERE `address`.`person_id` IS NULL and `address`.`person_id` IS not NULL and `address`.`deleted_at` IS NULL ORDER BY `id` ASC
SELECT * FROM `person` WHERE `person`.`deleted_at` IS NULL ORDER BY `id` DESC LIMIT 10 offset 0

    public function edit(Request $request, $id)
    {
        $status = false;
        if ($request->isMethod('post')) {
            $request->validate([
                'name' => ['required', 'max:50'],
                'gender' => ['required', new GenderCheck()],
                'birthday' => ['required', 'date_format:d/m/Y'],
            ]);
            $status = PersonController::update($request, $id);
        }
        $person = Person::where('id', $id)->first();
---
SELECT * FROM `person` WHERE `id` = '44' and `person`.`deleted_at` IS NULL LIMIT 1

    public function update(Request $request, $id)
    {
        return Person::where('id', $id)->update([
            'name' => $request->name,
            'gender' => $request->gender,
            'birthday' => $this->convertdateFormat($request->birthday),
        ]);
---
UPDATE `person` SET `name` = 'wefwefew', `gender` = 'female', `birthday` = '1111-11-11', `person`.`updated_at` = '2022-09-15 12:27:59' WHERE `id` = '44' and `person`.`deleted_at` IS NULL